<?xml version="1.0" encoding="UTF-8"?>
 <!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
 <plist version="1.0">
 <dict>
 	<key>Description</key>
 	<string>Testing Rich Trouton, ramyhhh, and Orchard recipes for use with CC for M1 -  Downloads the latest version of Adobe's Creative Cloud Desktop App Installer and packages it for installation.</string>
 	<key>Identifier</key>
 	<string>com.github.precursorca.pkg.AdobeCreativeCloudInstaller.M1</string>
 	<key>Input</key>
 	<dict>
 		<key>NAME</key>
 		<string>Creative Cloud Installer M1</string>
 		<key>VENDOR</key>
 		<string>Adobe</string>
 		<key>SOFTWARETITLE</key>
 		<string>Creative Cloud Installer</string>
 		<key>NAMEWITHOUTSPACES</key>
 		<string>CreativeCloudInstaller</string>
 	</dict>
 	<key>MinimumVersion</key>
 	<string>1.0.0</string>
 	<key>ParentRecipe</key>
 	<string>com.github.precursorca.download.AdobeCreativeCloudInstaller.M1</string>
 	<key>Process</key>
 	<array>
 		<dict>
 			<key>Processor</key>
 			<string>PkgRootCreator</string>
 			<key>Arguments</key>
 			<dict>
 				<key>pkgroot</key>
 				<string>%RECIPE_CACHE_DIR%/pkgroot</string>
 				<key>pkgdirs</key>
 				<dict/>
 			</dict>
 		</dict>
 		<dict>
 			<key>Arguments</key>
 			<dict>
 				<key>source_path</key>
 				<string>%pathname%/packages/ApplicationInfo.xml</string>
 				<key>destination_path</key>
 				<string>%RECIPE_CACHE_DIR%/ApplicationInfo.xml</string>
 				<key>overwrite</key>
 				<true/>
 			</dict>
 			<key>Processor</key>
 			<string>Copier</string>
 		</dict>
 		<dict>
 			<key>Arguments</key>
 			<dict>
 				<key>xml_path</key>
 				<string>%RECIPE_CACHE_DIR%/ApplicationInfo.xml</string>
 				<key>elements</key>
 				<array>
 					<dict>
 						<key>xpath</key>
 						<string>version</string>
 						<key>text</key>
 						<string>version</string>
 					</dict>
 				</array>
 			</dict>
 			<key>Processor</key>
 			<string>XMLReader</string>
 		</dict>
 		<dict>
 			<key>Processor</key>
 			<string>Copier</string>
 			<key>Arguments</key>
 			<dict>
 				<key>source_path</key>
 				<string>%pathname%/Install.app</string>
 				<key>destination_path</key>
 				<string>%RECIPE_CACHE_DIR%/Scripts/Install.app</string>
 				<key>overwrite</key>
 				<true/>
 			</dict>
 		</dict>
 		<dict>
 			<key>Processor</key>
 			<string>Copier</string>
 			<key>Arguments</key>
 			<dict>
 				<key>source_path</key>
 				<string>%pathname%/packages</string>
 				<key>destination_path</key>
 				<string>%RECIPE_CACHE_DIR%/Scripts/packages</string>
 				<key>overwrite</key>
 				<true/>
 			</dict>
 		</dict>
 		<dict>
 			<key>Processor</key>
 			<string>Copier</string>
 			<key>Arguments</key>
 			<dict>
 				<key>source_path</key>
 				<string>%pathname%/resources</string>
 				<key>destination_path</key>
 				<string>%RECIPE_CACHE_DIR%/Scripts/resources</string>
 				<key>overwrite</key>
 				<true/>
 			</dict>
 		</dict>
 		<dict>
 			<key>Processor</key>
 			<string>FileCreator</string>
 			<key>Arguments</key>
 			<dict>
 				<key>file_path</key>
 				<string>%RECIPE_CACHE_DIR%/Scripts/postinstall</string>
 				<key>file_mode</key>
 				<string>0755</string>
 				<key>file_content</key>
 				<string>#!/bin/bash

 # Determine working directory
 install_dir=$(dirname $0)

 # Install the Creative Cloud  application using the Install binary's silent install mode
 "${install_dir}/Install.app/Contents/MacOS/Install" --mode=silent</string>
 			</dict>
 		</dict>
 		<dict>
 			<key>Processor</key>
 			<string>PkgCreator</string>
 			<key>Arguments</key>
 			<dict>
 				<key>pkg_request</key>
 				<dict>
 					<key>pkgroot</key>
 					<string>%RECIPE_CACHE_DIR%/pkgroot</string>
 					<key>pkgname</key>
 					<string>%VENDOR%%NAMEWITHOUTSPACES%-%version%</string>
 					<key>pkgtype</key>
 					<string>flat</string>
 					<key>id</key>
 					<string>com.adobe.AdobeCreativeCloudInstaller.pkg</string>
 					<key>version</key>
 					<string>%version%</string>
 					<key>scripts</key>
 					<string>Scripts</string>
 				</dict>
 			</dict>
 		</dict>
 		<dict>
 			<key>Processor</key>
 			<string>PathDeleter</string>
 			<key>Arguments</key>
 			<dict>
 				<key>path_list</key>
 				<array>
 					<string>%RECIPE_CACHE_DIR%/pkgroot</string>
 					<string>%RECIPE_CACHE_DIR%/Scripts</string>
 					<string>%RECIPE_CACHE_DIR%/ApplicationInfo.xml</string>
 				</array>
 			</dict>
 		</dict>
 	</array>
 </dict>
 </plist>
