<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
  <dict>
    <key>Attribution</key>
    <dict>
      <key>Copyright</key>
      <string>University of Oxford 2016</string>
      <key>Author</key>
      <dict>
        <key>Name</key>
        <string>Ben Goodstein</string>
        <key>Email</key>
        <string>ben.goodstein at it.ox.ac.uk</string>
        <key>Github</key>
        <string>fuzzylogiq</string>
      </dict>
    </dict>
    <key>Description</key>
    <string>Testing Rich Trouton, ramyhhh, and Orchard recipes for use with CC for M1 - </string>
    <key>Identifier</key>
    <string>com.github.precursorca.munki.AdobeCreativeCloudInstaller.M1</string>
    <key>Input</key>
    <dict>
      <key>MUNKI_REPO_SUBDIR</key>
      <string>apps/Adobe</string>
      <key>NAME</key>
      <string>Creative Cloud Installer</string>
      <key>pkginfo</key>
      <dict>
        <key>catalogs</key>
        <array>
          <string>testing</string>
        </array>
        <key>category</key>
        <string>Creative Cloud</string>
        <key>description</key>
        <string>This installs the Creative Cloud app (Arm) that runs in your taskbar and allows you to install and update Creative Cloud apps.</string>
        <key>developer</key>
        <string>Adobe</string>
        <key>display_name</key>
        <string>Creative Cloud Installer</string>
        <key>name</key>
        <string>Creative_Cloud_Installer</string>
        <key>unattended_install</key>
        <true/>
        <key>postinstall_script</key>
			<string>#!/bin/zsh

# Script to create a serviceconfig.xml file to allow standard users to update Creative Cloud and install Apps

OUTPUT_FILE="/Library/Application Support/Adobe/OOBE/Configs/ServiceConfig.xml"
CONTENTS="<config><panel><name>AppsPanel</name><visible>true</visible></panel><panel><name>FilesPanel</name><masked>false</masked></panel><panel><name>MarketPanel</name><masked>false</masked></panel><feature><name>SelfServeInstalls</name><enabled>true</enabled></feature><feature><name>BrowserBasedAuthentication</name><enabled>false</enabled></feature><feature><name>SelfServePluginsInstall</name><enabled>true</enabled></feature><feature><name>AppsAutoUpdate</name><enabled>true</enabled></feature></config>"

mkdir /Library/Application\ Support/Adobe/OOBE
mkdir /Library/Application\ Support/Adobe/OOBE/Configs

# Create ServiceConfig.xml file
Touch $OUTPUT_FILE
# Output data here
echo "$CONTENTS" > ${OUTPUT_FILE}
#END Output data

exit 0
		</string>
      </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.precursorca.pkg.AdobeCreativeCloudInstaller.M1</string>
    <key>Process</key>
    <array>
      <dict>
        <key>Processor</key>
        <string>MunkiImporter</string>
        <key>Arguments</key>
        <dict>
          <key>pkg_path</key>
          <string>%pkg_path%</string>
          <key>repo_subdirectory</key>
          <string>%MUNKI_REPO_SUBDIR%</string>
        </dict>
      </dict>
    </array>
  </dict>
</plist>
