<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Adobe's RemoteUpdateManager from Adobe and packages into /usr/local/bin/.</string>
	<key>Identifier</key>
	<string>com.github.precursorca.pkg.RemoteUpdateManager.M1</string>
	<key>Input</key>
	<dict>
		<key>IDENTIFIER</key>
		<string>com.adobe.RemoteUpdateManager</string>
		<key>NAME</key>
		<string>Adobe RemoteUpdateManager</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.precursorca.download.RemoteUpdateManager.M1</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkgdirs</key>
				<dict>
					<key>usr/local/bin</key>
					<string>0755</string>
				</dict>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/payload</string>
			</dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%pkgroot%/usr/local/bin/RemoteUpdateManager</string>
				<key>source_path</key>
				<string>%pathname%/RemoteUpdateManager</string>
			</dict>
			<key>Processor</key>
			<string>Copier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_file_path</key>
				<string>%destination_path%</string>
				<key>plist_version_key</key>
				<string>CFBundleShortVersionString</string>
			</dict>
			<key>Processor</key>
			<string>com.github.homebysix.BinaryFileVersioner/BinaryFileVersioner</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>split_on</key>
				<string>,</string>
			</dict>
			<key>Processor</key>
			<string>com.github.homebysix.VersionSplitter/VersionSplitter</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_request</key>
				<dict>
					<key>chown</key>
					<array>
						<dict>
							<key>group</key>
							<string>wheel</string>
							<key>mode</key>
							<string>755</string>
							<key>path</key>
							<string>usr</string>
							<key>user</key>
							<string>root</string>
						</dict>
					</array>
					<key>id</key>
					<string>%IDENTIFIER%</string>
					<key>options</key>
					<string>purge_ds_store</string>
					<key>pkgname</key>
					<string>%NAME%-%ARCH%-%version%</string>
					<key>pkgroot</key>
					<string>%RECIPE_CACHE_DIR%/payload</string>
				</dict>
			</dict>
			<key>Processor</key>
			<string>PkgCreator</string>
		</dict>
	</array>
</dict>
</plist>
