<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
  <dict>
    <key>Description</key>
    <string></string>
    <key>Identifier</key>
    <string>com.github.precursorca.munki.RemoteUpdateManager</string>
    <key>Input</key>
    <dict>
      <key>MUNKI_REPO_SUBDIR</key>
      <string>Adobe</string>
      <key>NAME</key>
      <string>Adobe RemoteUpdateManager</string>
      <key>pkginfo</key>
      <dict>
        <key>catalogs</key>
        <array>
          <string>testing</string>
        </array>
        <key>category</key>
        <string>Creativity</string>
        <key>description</key>
        <string>This installs the Adobe RUM component to scripts updates of existing CC installs</string>
        <key>developer</key>
        <string>Adobe</string>
        <key>display_name</key>
        <string>Adobe RemoteUpdateManager</string>
        <key>name</key>
        <string>Adobe RemoteUpdateManager</string>
        <key>supported_architectures</key>
			  <array>
				  <string>x86_64</string>
			  </array>
        <key>unattended_install</key>
        <true/>
      </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.1</string>
    <key>ParentRecipe</key>
    <string>com.github.moofit-recipes.pkg.RemoteUpdateManager</string>
    <key>Process</key>
    <array>
      <dict>
        <key>Processor</key>
        <string>MunkiImporter</string>
        <key>Arguments</key>
        <dict>
          <key>pkg_path</key>
          <string>%pkg_path%</string>
          <key>repo_subdirectory</key>
          <string>%MUNKI_REPO_SUBDIR%</string>
        </dict>
      </dict>
    </array>
  </dict>
</plist>
