<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>MinimumVersion</key>
	<string>0.2.3</string>
	<key>Identifier</key>
	<string>com.github.precursorca.munki.swiftdialog</string>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.precursorca.download.swiftdialog</string>
	<key>Description</key>
	<string>Imports swiftDialog into Munki</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>swiftDialog</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>utilities/swiftDialog</string>
		<key>MUNKI_CATEGORY</key>
		<string>Utilities</string>
		<key>MUNKI_DEVELOPER</key>
		<string>Bart Reardon</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>%MUNKI_CATEGORY%</string>
			<key>description</key>
			<string>swiftDialog is an open source admin utility app for macOS 11+ written in SwiftUI that displays a popup dialog, displaying the content to your users that you want to display.

swiftDialog's purpose is as a tool for Mac Admins to show informative messages via scripts, and relay back the users actions.</string>
			<key>developer</key>
			<string>%MUNKI_DEVELOPER%</string>
			<key>minimum_os_version</key>
			<string>12.0</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>display_name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
