<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Privileges.app and imports it into Munki</string>
	<key>Identifier</key>
	<string>com.github.precursorca.munki.privileges</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_CATEGORY</key>
		<string>Utilities</string>
		<key>MUNKI_DEVELOPER</key>
		<string>SAP</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/Privileges</string>
		<key>NAME</key>
		<string>Privileges</string>
		<key>DISPLAYNAME</key>
		<string>Privileges</string>
		<key>DESCRIPTION</key>
		<string>Privileges.app for macOS is designed to allow users to work as a standard user for day-to-day use, by providing a quick and easy way to get administrator rights when needed. When you do need admin rights, you can get them by clicking on the Privileges icon in your Dock.</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>%MUNKI_CATEGORY%</string>
			<key>description</key>
			<string>%DESCRIPTION%</string>
			<key>developer</key>
			<string>%MUNKI_DEVELOPER%</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>display_name</key>
			<string>%DISPLAYNAME%</string>
			<key>unattended_install</key>
			<true/>
			<key>unattended_uninstall</key>
			<true/>
			<key>postinstall_script</key>
			<string>#!/bin/bash

# install the privilege helper
cp /Applications/Privileges.app/Contents/Library/LaunchServices/corp.sap.privileges.helper /Library/PrivilegedHelperTools/corp.sap.privileges.helper

# create launchdaemon plist
SCRIPTID="privileges.helper"
MY_DOMAIN_REVERSE="corp.sap"
PLISTBUDDYLOC="/usr/libexec/plistbuddy"
PLISTNAME="${MY_DOMAIN_REVERSE}.${SCRIPTID}"
PLISTLOC="/Library/LaunchDaemons/${PLISTNAME}.plist"
DOCKUTILLOC="/usr/local/bin/dockutil"

$PLISTBUDDYLOC -c "Add :CFBundleIdentifier string ${PLISTNAME}" $PLISTLOC

$PLISTBUDDYLOC -c "Add :CFBundleInfoDictionaryVersion string 6.0" $PLISTLOC

$PLISTBUDDYLOC -c "Add :CFBundleName string PrivilegesHelper" $PLISTLOC

$PLISTBUDDYLOC -c "Add :CFBundleVersion string 1.0.1" $PLISTLOC

$PLISTBUDDYLOC -c "Add :SMAuthorizedClients array" $PLISTLOC
$PLISTBUDDYLOC -c "Add :SMAuthorizedClients:1 string identifier &quot;corp.sap.privileges&quot; and certificate leaf[subject.OU] = &quot;7R5ZEU67FQ&quot;" $PLISTLOC
$PLISTBUDDYLOC -c "Add :SMAuthorizedClients:2 string identifier &quot;corp.sap.privileges.cli&quot; and certificate leaf[subject.OU] = &quot;7R5ZEU67FQ&quot;" $PLISTLOC

# load launchdaemon
launchctl load $PLISTLOC

# Add it to the Dock
$DOCKUTILLOC --add /Applications/Privileges.app

exit 0</string>
			<key>postuninstall_script</key>
			<string>#!/bin/bash

SCRIPTID="privileges.helper"
MY_DOMAIN_REVERSE="corp.sap"
PLISTBUDDYLOC="/usr/libexec/plistbuddy"
PLISTNAME="${MY_DOMAIN_REVERSE}.${SCRIPTID}"
PLISTLOC="/Library/LaunchDaemons/${PLISTNAME}.plist"
DOCKUTILLOC="/usr/local/bin/dockutil"

# remove the privilege helper
rm /Library/PrivilegedHelperTools/corp.sap.privileges.helper

# unload launchdaemon plist
launchctl unload $PLISTLOC

# remove the launchcaemon plist
rm $PLISTLOC

# remove from Dock
$DOCKUTILLOC --remove /Applications/Privileges.app

exit 0</string>
		</dict>
	</dict>
    <key>ParentRecipe</key>
    <string>com.github.rtrouton.pkg.privileges</string>
    <key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pkg_path%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
    	</dict>
	</array>
</dict>
</plist>
